tutorials/incompressibleFluid/stirredTankLES_GPU/0/tracer
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      tracer;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Passive scalar for mixing time measurement
// Initially set to 0 everywhere, will be seeded via setFields

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    bottom
    {
        type            zeroGradient;
    }

    top
    {
        type            zeroGradient;
    }

    wall
    {
        type            zeroGradient;
    }

    "AMI_.*"
    {
        type            cyclicAMI;
    }
}

// ************************************************************************* //
