tutorials/incompressibleFluid/stirredTankLES_GPU/constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      dynamicMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Solid body rotation for impeller zone
mover
{
    type            motionSolver;
    libs            ("libfvMeshMovers.so" "libfvMotionSolvers.so");

    motionSolver    solidBody;

    cellZone        impeller;

    solidBodyMotionFunction rotatingMotion;

    rotatingMotionCoeffs
    {
        origin      (0 0 0);
        axis        (0 0 1);
        omega       300 [rpm];  // Impeller speed: 300 RPM = 5 rev/s
    }
}

// ************************************************************************* //
