tutorials/incompressibleFluid/stirredTankLES_GPU/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue tracer 0
);

regions
(
    // Initialize tracer blob at top of tank
    // Simulates adding a dye at the surface
    cylinderToCell
    {
        point1  (0 0 0.25);
        point2  (0 0 0.30);
        radius  0.05;

        fieldValues
        (
            volScalarFieldValue tracer 1
        );
    }
);

// ************************************************************************* //
