tutorials/incompressibleFluid/stirredTankLES_GPU/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Note: The impeller cellZone is already created by blockMesh
// This file is kept for reference and potential modifications

actions
(
    // The impeller zone is defined in blockMesh via block naming
    // No additional topoSet actions needed
);

// ************************************************************************* //
